export-1/SoapToRest/in/checkPhoneNumber_post.xml

<header description="SOAPAction" name="SOAPAction" scope="transport" value="http://ws.cdyne.com/PhoneVerify/query/CheckPhoneNumber"/>
<property name="REST_URL_POSTFIX" scope="axis2" action="remove"/>
<property expression="json-eval($.CheckPhoneNumber.LicenseKey)" name="req.var.CheckPhoneNumber.LicenseKey"/>
<property expression="json-eval($.CheckPhoneNumber.PhoneNumber)" name="req.var.CheckPhoneNumber.PhoneNumber"/>


<payloadFactory description="transform" media-type="xml">
  <format>
  <soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://ws.cdyne.com/PhoneVerify/query">
  <soapenv:Header/>
  <soapenv:Body>
  	<web:CheckPhoneNumber xmlns:web="http://ws.cdyne.com/PhoneVerify/query">
   <web:LicenseKey>$1</web:LicenseKey>
   <web:PhoneNumber>$2</web:PhoneNumber>
</web:CheckPhoneNumber>

  </soapenv:Body>
  </soapenv:Envelope>
  </format>
  <args>
 	<arg evaluator="xml" expression="get-property('req.var.CheckPhoneNumber.LicenseKey')"/>
<arg evaluator="xml" expression="get-property('req.var.CheckPhoneNumber.PhoneNumber')"/>

  </args>
</payloadFactory>
<property description="messageProperty" name="messageType" scope="axis2" type="STRING" value="application/soap+xml"/>
