ei/soap-rest/.metadata/.plugins/org.eclipse.core.resources/.history/88/007dc6db7f1d00171fa2d82d45e57803

<?xml version="1.0" encoding="UTF-8"?>
<api context="/phoneverify" name="phoneVerify" xmlns="http://ws.apache.org/ns/synapse">
    <resource methods="GET" uri-template="/{phoneNumber}">
        <inSequence>
            <payloadFactory media-type="xml">
                <format>
                    <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                        <soap:Body>
                            <CheckPhoneNumber xmlns="http://ws.cdyne.com/PhoneVerify/query">
                                <PhoneNumber>$1</PhoneNumber>
                                <LicenseKey>0</LicenseKey>
                            </CheckPhoneNumber>
                        </soap:Body>
                    </soap:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property(&quot;uri.var.phoneNumber&quot;)"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="default" value="http://ws.cdyne.com/PhoneVerify/query/CheckPhoneNumbers"/>
            <send>
                <endpoint key="phoneverifyEP"/>
            </send>
        </inSequence>
        <outSequence>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <send/>
        </outSequence>
        <faultSequence/>
    </resource>
    <resource methods="POST" url-mapping="/*">
        <inSequence>
            <property name="messageType" scope="axis2" type="STRING" value="application/xml"/>
            <log level="full"/>
        </inSequence>
        <outSequence/>
        <faultSequence/>
    </resource>
</api>
